Revit 2026 API

# BuiltInFailuresParameterFailures Class

---

Failures related to parameters and parameter operations.

SystemObject Autodesk.Revit.DBBuiltInFailuresParameterFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ParameterFailures
```
```vb
Public NotInheritable Class ParameterFailures
```
```cpp
public ref class ParameterFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ParameterFailures = class end
```

The BuiltInFailuresParameterFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | InconsistentSharedParameterDefinitions | The shared parameter '...' cannot be added with name '...' and type '...' because it conflicts with the existing name '...' and type '...'. |
|  | UnrecognizedSharedParameterDataType | The shared parameter '...' with name '...' cannot be added because its data type is not recognized. |

#### Reference

Autodesk.Revit.DB Namespace